notes/06LinearRegression.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>6 Linear Regression</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oishe Farhan" />
<h1 class="titleTOP"> <a href="../index.html">Machine Learning</a></h1>
<link rel="stylesheet" type="text/css" href="../css/style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">6 Linear Regression</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Analytical Solution</h2>
<div class="outline-text-2" id="text-1">
<p>
There exists another way to solve for the weights using linear algebra in one step. It is reminiscent of an calculus min/mac method:<br  />
$$ \frac{d}{d\theta} J(\theta) = 0 \qquad \text{Solve for the vector }\theta$$<br  />
Instead of solving for the actual hypothesis function we would instead fill in all the numbers for each training pair. With just the numbers in a matrix form, we can find the best \(\theta\) by using vector projection. We'll be looking to solve the following equation:<br  />
$$X \theta = y$$<br  />
<b>NOTE</b>: We will follow the coursera method, but this could also be re-orginsed and re-written in a different way: \(\theta X = y\)<br  />
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Design Matrix \(X\)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Input matrix containing features and training points<br  />
</li>
<li>\(m\) -rows for \(m\) training points<br  />
</li>
<li>\((n+1)\) - columns for \(n\) features<br  />
<ul class="org-ul">
<li>Includes the extra \(x_0\) feature<br  />
</li>
<li>\(x_0=1\) for all training points<br  />
</li>
</ul>
</li>
<li>\(x_n^{(m)} = n \text{th feature of } m \text{th training point}\)<br  />
</li>
</ul>
<p>
$$X = \begin{bmatrix}
x_0^1 & x_1^1 & \cdots & x_n^1  \\
x_0^2 & x_1^2 & \cdots & x_n^2  \\
x_0^3 & x_1^3 & \cdots & x_n^3  \\
\vdots& \vdots& \ddots &        \\
x_0^m & x_1^m &        & x_n^m  \\
\end{bmatrix}$$<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Full equation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
$$\begin{bmatrix}<br  />
x_0^1 &amp; x_1^1 &amp; &ctdot; &amp; x_n^1  <br  />
x_0^2 &amp; x_1^2 &amp; &ctdot; &amp; x_n^2  <br  />
x_0^3 &amp; x_1^3 &amp; &ctdot; &amp; x_n^3  <br  />
\vdots&amp; \vdots&amp; \ddots &amp;        <br  />
x_0^m &amp; x_1^m &amp;        &amp; x_n^m  <br  />
\end{bmatrix}<br  />
</p>
<p>
\begin{bmatrix}<br  />
&theta;_0 \\ &theta;_1 \\ &theta;_2 \\ \vdots \\ &theta;_n <br  />
\end{bmatrix} =<br  />
</p>
<p>
\begin{bmatrix}<br  />
y^0 \\ y^1 \\ y^2 \\ \vdots \\ y^m <br  />
\end{bmatrix}$$<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Solving \(\theta\)</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Turn the design matrix \(X\) into a square matrix to find the inverse.<br  />
</li>
<li>Multiply the transpose \(X^T\) to each side<br  />
</li>
<li>Find the inverse and multiply to each side<br  />
</li>
</ol>
<p>
$$\begin{align*}
X \theta                    &= y                  \\
X^T X \theta                &= X^T y              \\
(X^T X)^{-1} (X^T X) \theta &= (X^T X)^{-1} X^T y \\
                     \theta &= (X^T X)^{-1} X^T y \\
\end{align*}$$<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Cases for Noninvertability</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Sometimes \(X^TX\) is noninvertible<br  />
</p>
<ul class="org-ul">
<li>Two or more redundant features<br  />
<ul class="org-ul">
<li>very closely related<br  />
</li>
<li>linearly dependent<br  />
</li>
</ul>
</li>
<li>Too many features not enough training points<br  />
<ul class="org-ul">
<li>\(n \leq m\)<br  />
</li>
<li>regularization method to be applied<br  />
</li>
</ul>
</li>
</ul>
<p>
For solving use \(\text{pinv}\) instead of \(\text{inv}\). Stands for pseudo-inverse.<br  />
</p>
<div class="org-src-container">

<pre class="src src-matlab">theta = pinv(X'*X)*X'*y;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> When to use the normal equation</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="center" />

<col  class="center" />
</colgroup>
<thead>
<tr>
<th scope="col" class="center"><b>Gradient Descent</b></th>
<th scope="col" class="center"><b>Normal Equation</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="center">Feature scalling</td>
<td class="center">No feature scalling</td>
</tr>

<tr>
<td class="center">Need to choose &alpha;</td>
<td class="center">No need to choose &alpha;</td>
</tr>

<tr>
<td class="center">Needs multiple iterations</td>
<td class="center">Iteration isn't need</td>
</tr>

<tr>
<td class="center">\(O(kn^2)\)</td>
<td class="center">\(O(n^3)\) because of \((X^TX)^-1\)</td>
</tr>

<tr>
<td class="center">Works great for large \(n\)</td>
<td class="center">Slow if \(n > 10000\)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
<footer>
<hr/>
<p>Author: Oishe Farhan</p>
<p>Email: farhanoishe@gmail.com</p>
</footer>
</html>
